cats_99/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find(params[:id])
        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["birth_date", "2016-12-04"], ["color", "Calico"], ["description", "I am Arry"], ["updated_at", "2020-12-05 18:00:27.575910"], ["id", 10]]